nxp-mcuxpresso/mcux-soc-svd/LPC54S018/LPC54S018.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="SMARTCARD0">
      <name>SMARTCARD1</name>
      <description>LPC5460x/LPC54S60x Smart Card Interface</description>
      <groupName>SMARTCARD</groupName>
      <baseAddress>0x40037000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SMARTCARD1</name>
        <value>56</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>PUF</name>
      <description>PUF</description>
      <groupName>PUF</groupName>
      <baseAddress>0x4003B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x110</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PUF</name>
        <value>58</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>PUF Control register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x5F</resetMask>
          <fields>
            <field>
              <name>zeroize</name>
              <description>Begin Zeroize operation for Quiddikey and go to Error state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>enroll</name>
              <description>Begin Enroll operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>start</name>
              <description>Begin Start operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GENERATEKEY</name>
              <description>Begin Set Intrinsic Key operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETKEY</name>
              <description>Begin Set User Key operation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GETKEY</name>
              <description>Begin Get Key operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYINDEX</name>
          <description>PUF Key Index register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>KEYIDX</name>
              <description>Key index for Set Key operations</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSIZE</name>
          <description>PUF Key Size register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>KEYSIZE</name>
              <description>Key size for Set Key operations</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>PUF Status register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xF7</resetMask>
          <fields>
            <field>
              <name>busy</name>
              <description>Indicates that operation is in progress</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUCCESS</name>
              <description>Last operation was successful</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>error</name>
              <description>Quiddikey is in the Error state and no operations can be performed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEYINREQ</name>
              <description>Request for next part of key</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEYOUTAVAIL</name>
              <description>Next part of key is available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CODEINREQ</name>
              <description>Request for next part of AC/KC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CODEOUTAVAIL</name>
              <description>Next part of AC/KC is available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALLOW</name>
          <description>PUF Allow register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x8F</resetMask>
          <fields>
            <field>
              <name>ALLOWENROLL</name>
              <description>Enroll operation is allowed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALLOWSTART</name>
              <description>Start operation is allowed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALLOWSETKEY</name>
              <description>Set Key operations are allowed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALLOWGETKEY</name>
              <description>Get Key operation is allowed</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYINPUT</name>
          <description>PUF Key Input register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYIN</name>
              <description>Key input data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CODEINPUT</name>
          <description>PUF Code Input register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CODEIN</name>
              <description>AC/KC input data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CODEOUTPUT</name>
          <description>PUF Code Output register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CODEOUT</name>
              <description>AC/KC output data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYOUTINDEX</name>
          <description>PUF Key Output Index register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>KEYOUTIDX</name>
              <description>Key index for the key that is currently output via the Key Output register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYOUTPUT</name>
          <description>PUF Key Output register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYOUT</name>
              <description>Key output data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFSTAT</name>
          <description>PUF Interface Status and clear register</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ERROR</name>
              <description>Indicates that an APB error has occurred,Writing logic1 clears the if_error bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>PUF Interrupt Enable</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF7</resetMask>
          <fields>
            <field>
              <name>READYEN</name>
              <description>Enable corresponding interrupt. Note that bit numbers match those assigned in QK_SR (Quiddikey Status Register)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUCCESEN</name>
              <description>Enable corresponding interrupt. Note that bit numbers match those assigned in QK_SR (Quiddikey Status Register)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROREN</name>
              <description>Enable corresponding interrupt. Note that bit numbers match those assigned in QK_SR (Quiddikey Status Register)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYINREQEN</name>
              <description>Enable corresponding interrupt. Note that bit numbers match those assigned in QK_SR (Quiddikey Status Register)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYOUTAVAILEN</name>
              <description>Enable corresponding interrupt. Note that bit numbers match those assigned in QK_SR (Quiddikey Status Register)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODEINREQEN</name>
              <description>Enable corresponding interrupt. Note that bit numbers match those assigned in QK_SR (Quiddikey Status Register)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODEOUTAVAILEN</name>
              <description>Enable corresponding interrupt. Note that bit numbers match those assigned in QK_SR (Quiddikey Status Register)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>PUF interrupt status</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF7</resetMask>
          <fields>
            <field>
              <name>READY</name>
              <description>Triggers on falling edge of busy, write 1 to clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUCCESS</name>
              <description>Level sensitive interrupt, cleared when interrupt source clears</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR</name>
              <description>Level sensitive interrupt, cleared when interrupt source clears</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYINREQ</name>
              <description>Level sensitive interrupt, cleared when interrupt source clears</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYOUTAVAIL</name>
              <description>Level sensitive interrupt, cleared when interrupt source clears</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODEINREQ</name>
              <description>Level sensitive interrupt, cleared when interrupt source clears</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODEOUTAVAIL</name>
              <description>Level sensitive interrupt, cleared when interrupt source clears</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCTRL</name>
          <description>PUF RAM Power Control</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF8</resetValue>
          <resetMask>0xFD</resetMask>
          <fields>
            <field>
              <name>RAMON</name>
              <description>Power on the PUF RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMSTAT</name>
              <description>PUF RAM status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>PUF config register for block bits</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>BLOCKENROLL_SETKEY</name>
              <description>Block enroll operation. Write 1 to set, cleared on reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCKKEYOUTPUT</name>
              <description>Block set key operation. Write 1 to set, cleared on reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
