nxp-mcuxpresso/mcux-soc-svd/LPC54S018/LPC54S018.xml
        <register>
          <name>IDR</name>
          <description>ID Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4114F250</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ImplementationRevision</name>
              <description>Implementation revision. The value of these bits is b0000, indicating implementation revision, 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MinorETMarchitectureVersion</name>
              <description>Minor ETM architecture version. The value of these bits is 0b0101, indicating minor architecture version number 5.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MajorETMarchitectureVersion</name>
              <description>Major ETM architecture version. The value of these bits is 0b0010, indicating major architecture version number 3, ETMv3.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ProcessorFamily</name>
              <description>Processor family. The value of these bits is 0b1111, indicating that the processor family is not identified in this register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LoadPCfirst</name>
              <description>Load PC first. The value of this bit is 0, indicating that data tracing is not supported.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ThumbInstructionTracing</name>
              <description>32-bit Thumb instruction tracing. The value of this bit is 1, indicating that a 32-bit Thumb instruction is traced as a single instruction.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ThumbInstructionTracing_0</name>
                  <description>A 32-bit Thumb instruction is traced as two instructions, and exceptions might occur between these two instructions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ThumbInstructionTracing_1</name>
                  <description>A 32-bit Thimb instruction is traced as a single instruction.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SecurityExtensionSupport</name>
              <description>Security Extensions support. The value of this bit is 0, indicating that the ETM behaves as if the processor is in Secure state at all times.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SecurityExtensionSupport_0</name>
                  <description>The ETM behaves as if the processor is in Secure state at all times.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SecurityExtensionSupport_1</name>
                  <description>The ARM architecture Security Extensions are implemented by the processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BranchPacketEncoding</name>
              <description>Branch packet encoding. The value of this bit is 1, indicating that alternative branch packet encoding is implemented.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BranchPacketEncoding_0</name>
                  <description>The ETM implements the original branch packet encoding.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BranchPacketEncoding_1</name>
                  <description>The ETM implements the alternative branch packet encoding.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ImplementorCode</name>
              <description>Implementor code. These bits identify ARM as the implementor of the processor. The value of these bits is 01000001.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER</name>
          <description>Configuration Code Extension Register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x18541800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ExtendedExternalInputSelectors</name>
              <description>Extended external input selectors. The value of these bits is 0, indicating that extended external input selectors are not implemented.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ExtendedExternalInputBus</name>
              <description>Extended external input bus. The value of these bits is 0, indicating that the extended external input bus is not implemented.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ReadableRegisters</name>
              <description>Readable registers. The value of this bit is 1, indicating that all registers are readable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DataAddressComparisons</name>
              <description>Data address comparisons. The value of this bit is 1, indicating that data address comparisons are not supported.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>InstrumentationResources</name>
              <description>Instrumentation resources. The value of these bits is 0b000, indicating that no Instrumentation resources are supported.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EmbeddedICEwatchpointInputs</name>
              <description>EmbeddedICE watchpoint inputs. The value of these bits is 0b0100, indicating that the number of EmbeddedICE watchpoint inputs implemented is four. These inputs come from the DWT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TraceStartStopBlockUsesEmbeddedICEwatchpointInputs</name>
              <description>Trace Start/Stop block uses EmbeddedICE watchpoint inputs. The value of this bit is 1, indicating that the Trace Start/Stop block uses the EmbeddedICE watchpoint inputs.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EmbeddedICEbehaviorControlImplemented</name>
              <description>EmbeddedICE behavior control implemented. The value of this bit is 0, indicating that the ETMEIBCR is not implemented.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TimestampingImplemented</name>
              <description>Timestamping implemented. This bit is set to 1, indicating that timestamping is implemented.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ReducedFunctionCounter</name>
              <description>Reduced function counter. Set to 1 to indicate that Counter 1 is a reduced function counter.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TimestampEncoding</name>
              <description>Timestamp encoding. Set to 1 to indicate that the timestamp is encoded as a natural binary number.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TimestampSize</name>
              <description>Timestamp size. Set to 0 to indicate a size of 48 bits.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TESSEICR</name>
          <description>TraceEnable Start/Stop EmbeddedICE Control Register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFF0FFF0</resetMask>
          <fields>
            <field>
              <name>StartResourceSelection</name>
              <description>Start resource selection. Setting any of these bits to 1 selects the corresponding EmbeddedICE watchpoint input as a TraceEnable start resource. Bit [0] corresponds to input 1, bit [1] corresponds to input 2, bit [2] corresponds to input 3, and bit [3] corresponds to input 4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>StopResourceSelection</name>
              <description>Stop resource selection. Setting any of these bits to 1 selects the corresponding EmbeddedICE watchpoint input as a TraceEnable stop resource. Bit [16] corresponds to input 1, bit [17] corresponds to input 2, bit [18] corresponds to input 3, and bit [19] corresponds to input 4.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSEVR</name>
          <description>Timestamp Event Register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TimestampEvent</name>
              <description>Timestamp event.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACEIDR</name>
          <description>CoreSight Trace ID Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TraceID</name>
              <description>Trace ID to output onto the trace bus. On an ETM reset this field is cleared to 0x00.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR2</name>
          <description>ETM ID Register 2</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>PDSR</name>
          <description>Device Power-Down Status Register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ETMpoweredup</name>
              <description>The value of this bit indicates whether you can access the ETM Trace Registers. The value of this bit is always 1, indicating that the ETM Trace Registers can be accessed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_ITMISCIN</name>
          <description>Integration Test Miscelaneous Inputs Register</description>
          <addressOffset>0xEE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFE0</resetMask>
          <fields>
            <field>
              <name>EXTIN</name>
              <description>A read of these bits returns the value of the EXTIN[1:0] input pins.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COREHALT</name>
              <description>A read of this bit returns the value of the COREHALT input pin.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_ITTRIGOUT</name>
          <description>Integration Test Trigger Out Register</description>
          <addressOffset>0xEE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>TRIGGER</name>
              <description>A write to this bit sets the TRIGGER output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_ITATBCTR2</name>
          <description>ETM Integration Test ATB Control 2 Register</description>
          <addressOffset>0xEF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>ATREADY</name>
              <description>A read of this bit returns the value of the ETM ATREADY input.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_ITATBCTR0</name>
          <description>ETM Integration Test ATB Control 0 Register</description>
          <addressOffset>0xEF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>ATVALID</name>
              <description>A write to this bit sets the value of the ETM ATVALID output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>Integration Mode Control Register</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Mode</name>
              <description>Enable integration mode. When this bit is set to 1, the device enters integration mode to enable Topology Detection or Integration Testing to be checked. On an ETM reset this bit is cleared to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMSET</name>
          <description>Claim Tag Set Register</description>
          <addressOffset>0xFA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CLAIMSET</name>
              <description>A bit programmable register bank which sets the Claim Tag Value. Write 1 to set the bit in the claim tag. A read will return a logic 1 for all implemented locations.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>Claim Tag Clear Register</description>
          <addressOffset>0xFA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CLAIMCLR</name>
              <description>A bit programmable register bank that is zero at reset. Write 1 to clear the bit in the claim tag. On reads, returns the current setting of the claim tag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LAR</name>
          <description>Lock Access Register</description>
          <addressOffset>0xFB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WriteAccessCode</name>
              <description>Write Access Code. A write of 0xC5ACCE55 enables further write access to this device. An invalid write will have the affect of removing write access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>Lock Status Register</description>
          <addressOffset>0xFB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x5</resetMask>
          <fields>
            <field>
              <name>IMP</name>
              <description>Lock mechanism is implemented. This bit always reads 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS</name>
              <description>Lock Status. This bit is HIGH when the device is locked, and LOW when unlocked.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATUS_0</name>
                  <description>Access permitted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATUS_1</name>
                  <description>Write access to the component is blocked. All writes to control registers are ignored. Reads are permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>s8BIT</name>
              <description>Access Lock Register size. This bit reads 0 to indicate a 32-bit register is present.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
